HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxHssl_regdef.h
/**
 * \file IfxHssl_regdef.h
 * \brief
 * \copyright Copyright (c) 2014 Infineon Technologies AG. All rights reserved.
 *
 * Version: TC27XA_TS_V3.0.1.R2
 * Specification: TC27xA_TS_V3.0.1_SFR_OPEN_MARKET.xml (Revision: V3.0.1)
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Hssl Hssl
 * \ingroup IfxLld
 * 
 * \defgroup IfxLld_Hssl_Bitfields Bitfields
 * \ingroup IfxLld_Hssl
 * 
 * \defgroup IfxLld_Hssl_union Union
 * \ingroup IfxLld_Hssl
 * 
 * \defgroup IfxLld_Hssl_struct Struct
 * \ingroup IfxLld_Hssl
 * 
 */
#ifndef IFXHSSL_REGDEF_H
#define IFXHSSL_REGDEF_H 1
/******************************************************************************/
#include "Ifx_TypesReg.h"
/******************************************************************************/
/** \addtogroup IfxLld_Hssl_Bitfields
 * \{  */

/** \\brief  Access Enable Register 0 */
typedef struct _Ifx_HSSL_ACCEN0_Bits
{
    unsigned int EN0:1;                     /**< \brief [0:0] Access Enable for Master TAG ID n (rw) */
    unsigned int EN1:1;                     /**< \brief [1:1] Access Enable for Master TAG ID n (rw) */
    unsigned int EN2:1;                     /**< \brief [2:2] Access Enable for Master TAG ID n (rw) */
    unsigned int EN3:1;                     /**< \brief [3:3] Access Enable for Master TAG ID n (rw) */
    unsigned int EN4:1;                     /**< \brief [4:4] Access Enable for Master TAG ID n (rw) */
    unsigned int EN5:1;                     /**< \brief [5:5] Access Enable for Master TAG ID n (rw) */
    unsigned int EN6:1;                     /**< \brief [6:6] Access Enable for Master TAG ID n (rw) */
    unsigned int EN7:1;                     /**< \brief [7:7] Access Enable for Master TAG ID n (rw) */
    unsigned int EN8:1;                     /**< \brief [8:8] Access Enable for Master TAG ID n (rw) */
    unsigned int EN9:1;                     /**< \brief [9:9] Access Enable for Master TAG ID n (rw) */
    unsigned int EN10:1;                    /**< \brief [10:10] Access Enable for Master TAG ID n (rw) */
    unsigned int EN11:1;                    /**< \brief [11:11] Access Enable for Master TAG ID n (rw) */
    unsigned int EN12:1;                    /**< \brief [12:12] Access Enable for Master TAG ID n (rw) */
    unsigned int EN13:1;                    /**< \brief [13:13] Access Enable for Master TAG ID n (rw) */
    unsigned int EN14:1;                    /**< \brief [14:14] Access Enable for Master TAG ID n (rw) */
    unsigned int EN15:1;                    /**< \brief [15:15] Access Enable for Master TAG ID n (rw) */
    unsigned int EN16:1;                    /**< \brief [16:16] Access Enable for Master TAG ID n (rw) */
    unsigned int EN17:1;                    /**< \brief [17:17] Access Enable for Master TAG ID n (rw) */
    unsigned int EN18:1;                    /**< \brief [18:18] Access Enable for Master TAG ID n (rw) */
    unsigned int EN19:1;                    /**< \brief [19:19] Access Enable for Master TAG ID n (rw) */
    unsigned int EN20:1;                    /**< \brief [20:20] Access Enable for Master TAG ID n (rw) */
    unsigned int EN21:1;                    /**< \brief [21:21] Access Enable for Master TAG ID n (rw) */
    unsigned int EN22:1;                    /**< \brief [22:22] Access Enable for Master TAG ID n (rw) */
    unsigned int EN23:1;                    /**< \brief [23:23] Access Enable for Master TAG ID n (rw) */
    unsigned int EN24:1;                    /**< \brief [24:24] Access Enable for Master TAG ID n (rw) */
    unsigned int EN25:1;                    /**< \brief [25:25] Access Enable for Master TAG ID n (rw) */
    unsigned int EN26:1;                    /**< \brief [26:26] Access Enable for Master TAG ID n (rw) */
    unsigned int EN27:1;                    /**< \brief [27:27] Access Enable for Master TAG ID n (rw) */
    unsigned int EN28:1;                    /**< \brief [28:28] Access Enable for Master TAG ID n (rw) */
    unsigned int EN29:1;                    /**< \brief [29:29] Access Enable for Master TAG ID n (rw) */
    unsigned int EN30:1;                    /**< \brief [30:30] Access Enable for Master TAG ID n (rw) */
    unsigned int EN31:1;                    /**< \brief [31:31] Access Enable for Master TAG ID n (rw) */
} Ifx_HSSL_ACCEN0_Bits;

/** \\brief  Access Enable Register 1 */
typedef struct _Ifx_HSSL_ACCEN1_Bits
{
    unsigned int reserved_0:32;             /**< \brief \internal Reserved */
} Ifx_HSSL_ACCEN1_Bits;

/** \\brief  Configuration Register */
typedef struct _Ifx_HSSL_CFG_Bits
{
    unsigned int PREDIV:14;                 /**< \brief [13:0] Global Predivider (rw) */
    unsigned int reserved_14:2;             /**< \brief \internal Reserved */
    unsigned int SMT:1;                     /**< \brief [16:16] Streaming Mode Transmitter (rw) */
    unsigned int SMR:1;                     /**< \brief [17:17] Streaming Mode Receiver (rw) */
    unsigned int SCM:1;                     /**< \brief [18:18] Streaming Channel Mode (rw) */
    unsigned int CCC:1;                     /**< \brief [19:19] Channel Code Control (rw) */
    unsigned int reserved_20:12;            /**< \brief \internal Reserved */
} Ifx_HSSL_CFG_Bits;

/** \\brief  Clock Control Register */
typedef struct _Ifx_HSSL_CLC_Bits
{
    unsigned int DISR:1;                    /**< \brief [0:0] Module Disable Request Bit (rw) */
    unsigned int DISS:1;                    /**< \brief [1:1] Module Disable Status Bit (rh) */
    unsigned int reserved_2:1;              /**< \brief \internal Reserved */
    unsigned int EDIS:1;                    /**< \brief [3:3] Sleep Mode Enable Control (rw) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_HSSL_CLC_Bits;

/** \\brief  CRC Control Register */
typedef struct _Ifx_HSSL_CRC_Bits
{
    unsigned int XORMASK:16;                /**< \brief [15:0] Value to be XORed with the Calculated CRC (rw) */
    unsigned int XEN:1;                     /**< \brief [16:16] Enable the Error Injection via XORMASK (rw) */
    unsigned int reserved_17:15;            /**< \brief \internal Reserved */
} Ifx_HSSL_CRC_Bits;

/** \\brief  Initiator Control Data Register */
typedef struct _Ifx_HSSL_I_ICON_Bits
{
    unsigned int IDQ:1;                     /**< \brief [0:0] Read ID Request (w) */
    unsigned int TQ:1;                      /**< \brief [1:1] Trigger Request (w) */
    unsigned int LETT:3;                    /**< \brief [4:2] Last Error Transaction Tag (rh) */
    unsigned int CETT:3;                    /**< \brief [7:5] Currently Expected Transaction Tag (rh) */
    unsigned int TOCV:8;                    /**< \brief [15:8] Time Out Current Value (rh) */
    unsigned int DATLEN:2;                  /**< \brief [17:16] Data Length (rw) */
    unsigned int RWT:2;                     /**< \brief [19:18] Read Write Trigger Command Type (rw) */
    unsigned int BSY:1;                     /**< \brief [20:20] Channel Busy (rh) */
    unsigned int ITTAG:3;                   /**< \brief [23:21] Initiator Transaction Tag (rh) */
    unsigned int TOREL:8;                   /**< \brief [31:24] Time Out Reload Value (rw) */
} Ifx_HSSL_I_ICON_Bits;

/** \\brief  Initiator Read Data Register */
typedef struct _Ifx_HSSL_I_IRD_Bits
{
    unsigned int DATA:32;                   /**< \brief [31:0] Data Delivered by a Read Response Frame (rh) */
} Ifx_HSSL_I_IRD_Bits;

/** \\brief  Initiator Read Write Address Register */
typedef struct _Ifx_HSSL_I_IRWA_Bits
{
    unsigned int ADDRESS:32;                /**< \brief [31:0] Address Part of the Payload of a Write Frame (rw) */
} Ifx_HSSL_I_IRWA_Bits;

/** \\brief  Initiator Write Data Register */
typedef struct _Ifx_HSSL_I_IWD_Bits
{
    unsigned int DATA:32;                   /**< \brief [31:0] Data Part of the Payload of a Write Frame (rw) */
} Ifx_HSSL_I_IWD_Bits;

/** \\brief  Module Identification Register */
typedef struct _Ifx_HSSL_ID_Bits
{
    unsigned int MODREV:8;                  /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MODTYPE:8;                 /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER:16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_HSSL_ID_Bits;

/** \\brief  Initiator Stream Current Address Register */
typedef struct _Ifx_HSSL_IS_CA_Bits
{
    unsigned int reserved_0:5;              /**< \brief \internal Reserved */
    unsigned int CURR:27;                   /**< \brief [31:5] Address of the Memory Location for the Current Transfer (rh) */
} Ifx_HSSL_IS_CA_Bits;

/** \\brief  Initiator Stream Frame Count Register */
typedef struct _Ifx_HSSL_IS_FC_Bits
{
    unsigned int RELCOUNT:16;               /**< \brief [15:0] Reload Count Number (rw) */
    unsigned int CURCOUNT:16;               /**< \brief [31:16] Current Count Number (rh) */
} Ifx_HSSL_IS_FC_Bits;

