HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxHssl_regdef.h
/** \\brief  Initiator Stream Start Address Register */
typedef struct _Ifx_HSSL_ISSA_Bits
{
    unsigned int reserved_0:5;              /**< \brief \internal Reserved */
    unsigned int START:27;                  /**< \brief [31:5] Start Address for the Memory Range (rw) */
} Ifx_HSSL_ISSA_Bits;

/** \\brief  Kernel Reset Register 0 */
typedef struct _Ifx_HSSL_KRST0_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int RSTSTAT:1;                 /**< \brief [1:1] Kernel Reset Status (rh) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_HSSL_KRST0_Bits;

/** \\brief  Kernel Reset Register 1 */
typedef struct _Ifx_HSSL_KRST1_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_HSSL_KRST1_Bits;

/** \\brief  Kernel Reset Status Clear Register */
typedef struct _Ifx_HSSL_KRSTCLR_Bits
{
    unsigned int CLR:1;                     /**< \brief [0:0] Kernel Reset Status Clear (w) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_HSSL_KRSTCLR_Bits;

/** \\brief  Miscellaneous Flags Register */
typedef struct _Ifx_HSSL_MFLAGS_Bits
{
    unsigned int NACK:4;                    /**< \brief [3:0] Not Acknowledge Error - Target Error (rh) */
    unsigned int TTE:4;                     /**< \brief [7:4] Transaction Tag Error (rh) */
    unsigned int TIMEOUT:4;                 /**< \brief [11:8] Timeout Error (rh) */
    unsigned int UNEXPECTED:4;              /**< \brief [15:12] Unexpected Type of Frame Error (rh) */
    unsigned int reserved_16:2;             /**< \brief \internal Reserved */
    unsigned int TMB:1;                     /**< \brief [18:18] Target Memory Block (rh) */
    unsigned int IMB:1;                     /**< \brief [19:19] Initiator Memory Block (rh) */
    unsigned int ISB:1;                     /**< \brief [20:20] Initiator Stream Block Request (rh) */
    unsigned int MAV:1;                     /**< \brief [21:21] Memory Access Violation (rh) */
    unsigned int SRIE:1;                    /**< \brief [22:22] SRI Bus Access Error (rh) */
    unsigned int PIE1:1;                    /**< \brief [23:23] PHY Inconsistency Error 1 (Channel Number Code Error) (rh) */
    unsigned int PIE2:1;                    /**< \brief [24:24] PHY Inconsistency Error 2 (Data Length Error) (rh) */
    unsigned int CRCE:1;                    /**< \brief [25:25] CRC Error (rh) */
    unsigned int reserved_26:2;             /**< \brief \internal Reserved */
    unsigned int TSE:1;                     /**< \brief [28:28] Target Stream Enable (rh) */
    unsigned int TEI:1;                     /**< \brief [29:29] Transmit Enable Input (rh) */
    unsigned int TEO:1;                     /**< \brief [30:30] Transmit Enable Output (rh) */
    unsigned int INI:1;                     /**< \brief [31:31] Initialize Mode (rh) */
} Ifx_HSSL_MFLAGS_Bits;

/** \\brief  Miscellaneous Flags Clear Register */
typedef struct _Ifx_HSSL_MFLAGSCL_Bits
{
    unsigned int NACKC:4;                   /**< \brief [3:0] NACK Flags Clear (w) */
    unsigned int TTEC:4;                    /**< \brief [7:4] Transaction Tag Error Flags Clear (w) */
    unsigned int TIMEOUTC:4;                /**< \brief [11:8] Timeout Error Flags Clear (w) */
    unsigned int UNEXPECTEDC:4;             /**< \brief [15:12] Unexpected Error Flags Clear (w) */
    unsigned int reserved_16:2;             /**< \brief \internal Reserved */
    unsigned int TMBC:1;                    /**< \brief [18:18] Target Memory Block Flag Clear (w) */
    unsigned int IMBC:1;                    /**< \brief [19:19] Initiator Memory Block Flag Clear (w) */
    unsigned int ISBC:1;                    /**< \brief [20:20] Initiator Stream Block Request Clear (w) */
    unsigned int MAVC:1;                    /**< \brief [21:21] MAV Flag Clear (w) */
    unsigned int SRIEC:1;                   /**< \brief [22:22] SRI Bus Access Error Flag Clear (w) */
    unsigned int PIE1C:1;                   /**< \brief [23:23] PIE1 Error Flag Clear (w) */
    unsigned int PIE2C:1;                   /**< \brief [24:24] PIE2 Error Flag Clear (w) */
    unsigned int CRCEC:1;                   /**< \brief [25:25] CRC Error Flag Clear (w) */
    unsigned int reserved_26:2;             /**< \brief \internal Reserved */
    unsigned int TSEC:1;                    /**< \brief [28:28] Target Stream Enable Flag Clear (w) */
    unsigned int reserved_29:1;             /**< \brief \internal Reserved */
    unsigned int TEOC:1;                    /**< \brief [30:30] Transmit Enable Flag Clear (w) */
    unsigned int INIC:1;                    /**< \brief [31:31] Initialize Mode Flag Clear (w) */
} Ifx_HSSL_MFLAGSCL_Bits;

/** \\brief  Flags Enable Register */
typedef struct _Ifx_HSSL_MFLAGSEN_Bits
{
    unsigned int NACKEN:4;                  /**< \brief [3:0] Not Acknowledge Error Enable Bits (rw) */
    unsigned int TTEEN:4;                   /**< \brief [7:4] Transaction Tag Error Enable Bits (rw) */
    unsigned int TIMEOUTEN:4;               /**< \brief [11:8] Timeout Error Enable Bits (rw) */
    unsigned int UNEXPECTEDEN:4;            /**< \brief [15:12] Unexpected Error Enable Bits (rw) */
    unsigned int reserved_16:5;             /**< \brief \internal Reserved */
    unsigned int MAVEN:1;                   /**< \brief [21:21] MAV Enable Bit (rw) */
    unsigned int SRIEEN:1;                  /**< \brief [22:22] SRI Bus Access Error Enable Bit (rw) */
    unsigned int PIE1EN:1;                  /**< \brief [23:23] PIE1 Error Enable Bit (rw) */
    unsigned int PIE2EN:1;                  /**< \brief [24:24] PIE2 Error Enable Bit (rw) */
    unsigned int CRCEEN:1;                  /**< \brief [25:25] CRC Error Enable Bit (rw) */
    unsigned int reserved_26:3;             /**< \brief \internal Reserved */
    unsigned int TEIEN:1;                   /**< \brief [29:29] TEI Enable Bit (rw) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_HSSL_MFLAGSEN_Bits;

